Revit 2027 API
BasicLossFactor Constructor
Overload List
Name | Description
BasicLossFactor() |  Creates a basic loss factor object with no loss.
BasicLossFactor(BasicLossFactor) |  Creates a copy of the given basic loss factor object
BasicLossFactor(Double) |  Creates a basic loss factor object with the given value.
Top
See Also
Reference
BasicLossFactor Class
Autodesk.Revit.DB.Lighting Namespace